"""
2.4 Функции print и input

Подвиг 11. Напишите программу вывода переменной math.pi с точностью до тысячных (три знака после запятой).

Sample Input:
Sample Output: 3.142
"""

# Подключаем библиотеку math
import math

# функуия - round(какое число округляем, до скольких знаков) - округляет число
print(round(math.pi, 3))
