"""
2.4 Функции print и input

Подвиг 2. В программе определите три следующие переменные:
a = 7
b = -4
c = 3

Выведите в консоль их значения в столбик (каждое новое значение отображается с новой строчки),
используя одну функцию print.

Sample Input:

Sample Output:
7
-4
3
"""

# Сохраняю данные в переменные
a = 7
b = -4
c = 3

# Вывожу полученные результаты в console
print(a)
print(b)
print(c)
