"""
1.3 Варианты выполнения команд. Переходим в PyCharm

Подвиг 2. С помощью функции print выведите сумму двух чисел 6+7

Sample Input:
Sample Output: 13
"""
a = 6 # присваиваю переменным значение
b = 7 # присваиваю переменным значение
sum = a + b # получаю сумму двух переменных
print(sum) #  вывожу данные из переменной sum, в консоль с помощью функции print
print(a + b) # передаю в print (переменные и складываю эти переменные в print)

print(6 + 7) # передаю два числа и сразу их складываю, в консоль выводится результат сложения
