"""
3.2 Индексы и срезы строк

Подвиг 4. Напишите программу отображения первых четырех символов из введенной строки.
Будем полагать, что строка гарантированно длиной не менее четырех символов.

Sample Input: panda
Sample Output: pand
"""
st = input() # Сохранения данных в переменную
print(st[0:4]) # показываем строку дилонй 4 символа
