"""
3.1 Введение в строки. Операции над строками

Подвиг 5. Напишите программу ввода двух строк (каждая вводится с новой строки)
и их объединения в одну строку через пробел. Результат выведите на экран.

Sample Input:
hello python
i love you

Sample Output: hello python i love you
"""

# Вводим информацию
str_1 = input()
str_2 = input()

print(str_1 + ' ' + str_2) # Выводим результат
