"""
3.2 Индексы и срезы строк

Подвиг 1. Напишите программу ввода строки и отображения на экране ее первого и последнего символа в виде одной строки.

Sample Input: I love Python
Sample Output: In
"""
st = input() # Сохранения данных в переменную
print(st[0] + st[-1]) # показываем 1 и последнюю букву
