"""
2.4 Функции print и input

Подвиг 4. Допишите программу, в которой вводятся два слова (в переменные s1 и s2) в одну строчку через пробел,
и отображаются в консоли в формате:
Word 1: s1 | Word 2: s2

Sample Input: I love
Sample Output: Word 1: I | Word 2: love
"""

# функция map() - принимает функцию и аргумент составного типа данных, в нашем случае мы получаем введенные символы
# str.strip - вернет копию строки str с удаленными начальными и конечными символами chars, без аргумента удаляет пробелы
s1, s2 = map(str.strip, input().split())

# sep - вместо разделет два переданных аргумента, переданным знаком, в нашем случае знаком |
print(f"Word 1: {s1}", f"Word 2: {s2}", sep=" | ")
