"""
2.4 Функции print и input

Подвиг 1. В программе определите три следующие переменные:
a = 7
b = -4
c = 3

Выведите в консоль их значения, используя одну функцию print (между значениями переменных должен стоять один пробел).

Sample Input:
Sample Output: 7 -4 3
"""

# Присваиваю значение переменным
# a = 7
# b = -4
# c = 3

a, b, c = 7, -4, 3 # Множественное присваиваение

print(f"{a} {b} {c}") #Выводим с помощью f-строки.
